<a href="https://colab.research.google.com/github/noushadkhan01/kansepur-flyash-project/blob/master/16%20sept%20to%201%20oct%20bill%208/kansepur_flyash_bill_16_sept_to_1_Oct.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from google.colab import drive

In [2]:
drive.mount('mydrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at mydrive

In [3]:
!ls

mydrive  sample_data

In [4]:
%cd mydrive/
!ls

/content/mydrive
'My Drive'

In [5]:
%cd My Drive/kansepur flyash project

/content/mydrive/My Drive/kansepur flyash project

In [6]:
!ls

 1_14_feb_bill.xlsx
 11_mar_to_5_apr.xlsx
'16 sept to 1 oct bill8.xlsx'
'16 sept to 30 sept bill8 2.xlsx'
'kansepur bill2.xlsx'
 kansepur_bill3.xlsx
 kansepur_bill4.xlsx
'kansepur flyash bill 10 aug to 15 sept bill7.xlsx'
 kansepur_soil_bill.xlsx

In [0]:
import pandas as pd

In [221]:
df = pd.read_excel('16 sept to 1 oct bill8.xlsx', 'Sheet1')
df.head()

   S.No.       Date Counts      Name  Quantity   Diesel
0    1.0 2019-09-16      1  khurseed       391  22000.0
1    2.0        NaT      2    gulfam       411      NaN
2    3.0        NaT      3     bhura       397      NaN
3    4.0        NaT      4     rasid       406      NaN
4    5.0        NaT      5     akram       360      NaN

   S.No.       Date Counts      Name  Quantity   Diesel
0    1.0 2019-09-16      1  khurseed       391  22000.0
1    2.0        NaT      2    gulfam       411      NaN
2    3.0        NaT      3     bhura       397      NaN
3    4.0        NaT      4     rasid       406      NaN
4    5.0        NaT      5     akram       360      NaN

In [222]:
df.tail(5)

     S.No. Date              Counts   Name  Quantity    Diesel
240  241.0  NaT                   4  bhura       397       NaN
241    NaN  NaT        Total Qty. =    NaN     99588  220300.0
242    NaN  NaT  Amount = Qty *4.25    NaN    423249       NaN
243    NaN  NaT            Diesel =    NaN    220300       NaN
244    NaN  NaT          Balance =     NaN    202949       NaN

     S.No. Date              Counts   Name  Quantity    Diesel
240  241.0  NaT                   4  bhura       397       NaN
241    NaN  NaT        Total Qty. =    NaN     99588  220300.0
242    NaN  NaT  Amount = Qty *4.25    NaN    423249       NaN
243    NaN  NaT            Diesel =    NaN    220300       NaN
244    NaN  NaT          Balance =     NaN    202949       NaN

In [223]:
df = df[:-4]
df.tail(2)

     S.No. Date Counts      Name  Quantity  Diesel
239  240.0  NaT      3  mukarram       400     NaN
240  241.0  NaT      4     bhura       397     NaN

     S.No. Date Counts      Name  Quantity  Diesel
239  240.0  NaT      3  mukarram       400     NaN
240  241.0  NaT      4     bhura       397     NaN

In [0]:
maap = {'imran':397, 'julfan':390, 'gulfam':411, 'saddam': 465, 'khurseed': 391, 'jabir': 416, 
        'akram': 360, 'wajid': 357, 'kayum': 308, 'bhura': 397, 'zishan': 484, 'rasid':406
        ,'mujahid':380, 'mukarram':400, 'jahid':435,'khan':425, 'dinesh':465, 'hasan':400, 'amjad':395, 'aslam':484
        }

In [225]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 241 entries, 0 to 240
Data columns (total 6 columns):
S.No.       241 non-null float64
Date        12 non-null datetime64[ns]
Counts      241 non-null object
Name        241 non-null object
Quantity    241 non-null int64
Diesel      12 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 11.4+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 241 entries, 0 to 240
Data columns (total 6 columns):
S.No.       241 non-null float64
Date        12 non-null datetime64[ns]
Counts      241 non-null object
Name        241 non-null object
Quantity    241 non-null int64
Diesel      12 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 11.4+ KB

##fill values

In [226]:
df.columns

Index(['S.No.', 'Date', 'Counts', 'Name', 'Quantity', 'Diesel'], dtype='object')

Index(['S.No.', 'Date', 'Counts', 'Name', 'Quantity', 'Diesel'], dtype='object')

In [227]:
df.Quantity.isnull().sum()

0

0

In [0]:
def fill_quantity(a):
  name, qty = a
  if pd.isnull(qty):
    return maap.get(name)
  else:
    maap[name] = qty
    return qty

In [0]:
df['Quantity'] = df[['Name', 'Quantity']].apply(fill_quantity, axis = 1)

In [230]:
df.Quantity.isnull().sum()

0

0

In [0]:
import numpy as np

In [232]:
df.Quantity[:3]

0    391
1    411
2    397
Name: Quantity, dtype: int64

0    391
1    411
2    397
Name: Quantity, dtype: int64

In [233]:
unique_dates = df.Date.unique()
unique_dates = pd.Series(unique_dates).dropna()
print(unique_dates)

0    2019-09-16
2    2019-09-17
3    2019-09-19
4    2019-09-20
5    2019-09-21
6    2019-09-24
7    2019-09-25
8    2019-09-26
9    2019-09-27
10   2019-09-28
11   2019-09-29
12   2019-10-01
dtype: datetime64[ns]
0    2019-09-16
2    2019-09-17
3    2019-09-19
4    2019-09-20
5    2019-09-21
6    2019-09-24
7    2019-09-25
8    2019-09-26
9    2019-09-27
10   2019-09-28
11   2019-09-29
12   2019-10-01
dtype: datetime64[ns]

In [234]:
df.Date.nunique()

12

12

In [235]:
df.Date.value_counts()

2019-09-26    1
2019-09-19    1
2019-09-29    1
2019-09-25    1
2019-09-28    1
2019-09-21    1
2019-10-01    1
2019-09-24    1
2019-09-17    1
2019-09-27    1
2019-09-20    1
2019-09-16    1
Name: Date, dtype: int64

2019-09-26    1
2019-09-19    1
2019-09-29    1
2019-09-25    1
2019-09-28    1
2019-09-21    1
2019-10-01    1
2019-09-24    1
2019-09-17    1
2019-09-27    1
2019-09-20    1
2019-09-16    1
Name: Date, dtype: int64

In [0]:
import numpy as np

In [237]:
df.Name.unique()

array(['khurseed', 'gulfam', 'bhura', 'rasid', 'akram', 'imran',
       'mukarram', 'julfan', 'jabir', 'dinesh', 'zishan', 'khan',
       'mujahid', 'saddam', 'aslam', 'amjad', 'hasan'], dtype=object)

array(['khurseed', 'gulfam', 'bhura', 'rasid', 'akram', 'imran',
       'mukarram', 'julfan', 'jabir', 'dinesh', 'zishan', 'khan',
       'mujahid', 'saddam', 'aslam', 'amjad', 'hasan'], dtype=object)

In [238]:
total_quantity = sum(df.Quantity)
total_quantity

99588

99588

In [239]:
rounds_per_name = df.Name.value_counts()
rounds_per_name

imran       29
rasid       27
khurseed    25
bhura       21
gulfam      19
saddam      18
jabir       17
julfan      17
amjad       15
dinesh      13
hasan       12
mukarram    10
akram        6
zishan       4
khan         4
mujahid      3
aslam        1
Name: Name, dtype: int64

imran       29
rasid       27
khurseed    25
bhura       21
gulfam      19
saddam      18
jabir       17
julfan      17
amjad       15
dinesh      13
hasan       12
mukarram    10
akram        6
zishan       4
khan         4
mujahid      3
aslam        1
Name: Name, dtype: int64

In [240]:
sum(rounds_per_name.values)

241

241

## unique feets per name

In [241]:
group = df.groupby(df.Name)
group

for i, j in group:
  print(i, '\n', j.Quantity, '\n')

print(group.get_group('gulfam'))

In [242]:
for i, j in group:
  print(i, j.Quantity.unique(), '\n')

akram [360]

amjad [395]

aslam [484]

bhura [397]

dinesh [465]

gulfam [411 473]

hasan [400]

imran [397]

jabir [416]

julfan [390]

khan [425]

khurseed [391]

mujahid [380]

mukarram [400]

rasid [406]

saddam [465]

zishan [484]

akram [360]

amjad [395]

aslam [484]

bhura [397]

dinesh [465]

gulfam [411 473]

hasan [400]

imran [397]

jabir [416]

julfan [390]

khan [425]

khurseed [391]

mujahid [380]

mukarram [400]

rasid [406]

saddam [465]

zishan [484]

df.to_excel('16 sept to 30 sept bill8 2.xlsx', index = False)
!ls

from google.colab import files

files.download('16 sept to 30 sept bill8 2.xlsx')

# Diesel

In [243]:
!ls

 1_14_feb_bill.xlsx
 11_mar_to_5_apr.xlsx
'16 sept to 1 oct bill8.xlsx'
'16 sept to 30 sept bill8 2.xlsx'
'kansepur bill2.xlsx'
 kansepur_bill3.xlsx
 kansepur_bill4.xlsx
'kansepur flyash bill 10 aug to 15 sept bill7.xlsx'
 kansepur_soil_bill.xlsx
 1_14_feb_bill.xlsx
 11_mar_to_5_apr.xlsx
'16 sept to 1 oct bill8.xlsx'
'16 sept to 30 sept bill8 2.xlsx'
'kansepur bill2.xlsx'
 kansepur_bill3.xlsx
 kansepur_bill4.xlsx
'kansepur flyash bill 10 aug to 15 sept bill7.xlsx'
 kansepur_soil_bill.xlsx

In [244]:
diesel = pd.read_excel('16 sept to 1 oct bill8.xlsx', 'Diesel')
diesel.head()

        Date      Name  Diesel   Cash
0 2019-09-16  khurseed    2000  800.0
1        NaT     bhura    2000    NaN
2        NaT    julfan    2000  500.0
3        NaT    gulfam    2000    NaN
4        NaT     jabir    2000    NaN

        Date      Name  Diesel   Cash
0 2019-09-16  khurseed    2000  800.0
1        NaT     bhura    2000    NaN
2        NaT    julfan    2000  500.0
3        NaT    gulfam    2000    NaN
4        NaT     jabir    2000    NaN

In [245]:
diesel.tail(3)

    Date      Name  Diesel     Cash
130  NaT  khurseed       0    200.0
131  NaT   mujahid       0   1000.0
132  NaT       NaN  220300  52670.0

    Date      Name  Diesel     Cash
130  NaT  khurseed       0    200.0
131  NaT   mujahid       0   1000.0
132  NaT       NaN  220300  52670.0

In [246]:
diesel = diesel[:-1]
diesel.tail(2)

    Date      Name  Diesel    Cash
130  NaT  khurseed       0   200.0
131  NaT   mujahid       0  1000.0

    Date      Name  Diesel    Cash
130  NaT  khurseed       0   200.0
131  NaT   mujahid       0  1000.0

In [247]:
diesel.shape

(132, 4)

(132, 4)

In [248]:
diesel.Date.unique()

array(['2019-09-16T00:00:00.000000000',                           'NaT',
       '2019-09-17T00:00:00.000000000', '2019-09-19T00:00:00.000000000',
       '2019-09-20T00:00:00.000000000', '2019-09-21T00:00:00.000000000',
       '2019-09-23T00:00:00.000000000', '2019-09-24T00:00:00.000000000',
       '2019-09-25T00:00:00.000000000', '2019-09-26T00:00:00.000000000',
       '2019-09-27T00:00:00.000000000', '2019-09-28T00:00:00.000000000',
       '2019-09-29T00:00:00.000000000', '2019-10-01T00:00:00.000000000'],
      dtype='datetime64[ns]')

array(['2019-09-16T00:00:00.000000000',                           'NaT',
       '2019-09-17T00:00:00.000000000', '2019-09-19T00:00:00.000000000',
       '2019-09-20T00:00:00.000000000', '2019-09-21T00:00:00.000000000',
       '2019-09-23T00:00:00.000000000', '2019-09-24T00:00:00.000000000',
       '2019-09-25T00:00:00.000000000', '2019-09-26T00:00:00.000000000',
       '2019-09-27T00:00:00.000000000', '2019-09-28T00:00:00.000000000',
       '2019-09-29T00:00:00.000000000', '2019-10-01T00:00:00.000000000'],
      dtype='datetime64[ns]')

In [0]:
for n, i in enumerate(diesel.Date.values):
  if not pd.isnull(i):
    date = i
  else:
    diesel.iloc[n, 0] = date

In [250]:
diesel.head()

        Date      Name  Diesel   Cash
0 2019-09-16  khurseed    2000  800.0
1 2019-09-16     bhura    2000    NaN
2 2019-09-16    julfan    2000  500.0
3 2019-09-16    gulfam    2000    NaN
4 2019-09-16     jabir    2000    NaN

        Date      Name  Diesel   Cash
0 2019-09-16  khurseed    2000  800.0
1 2019-09-16     bhura    2000    NaN
2 2019-09-16    julfan    2000  500.0
3 2019-09-16    gulfam    2000    NaN
4 2019-09-16     jabir    2000    NaN

In [251]:
diesel.tail()

          Date       Name  Diesel    Cash
127 2019-09-29        car     500     NaN
128 2019-09-29      total   16000     NaN
129 2019-10-01  vakil jcb       0  5000.0
130 2019-10-01   khurseed       0   200.0
131 2019-10-01    mujahid       0  1000.0

          Date       Name  Diesel    Cash
127 2019-09-29        car     500     NaN
128 2019-09-29      total   16000     NaN
129 2019-10-01  vakil jcb       0  5000.0
130 2019-10-01   khurseed       0   200.0
131 2019-10-01    mujahid       0  1000.0

In [252]:
diesel = diesel[:-1]
diesel.tail(2)

          Date       Name  Diesel    Cash
129 2019-10-01  vakil jcb       0  5000.0
130 2019-10-01   khurseed       0   200.0

          Date       Name  Diesel    Cash
129 2019-10-01  vakil jcb       0  5000.0
130 2019-10-01   khurseed       0   200.0

# pivot table

In [253]:
pivot_diesel = diesel.pivot_table(index = 'Name', columns = 'Date', values = 'Diesel')
pivot_diesel

Date       2019-09-16  2019-09-17  ...  2019-09-29  2019-10-01
Name                               ...
akram             NaN      2000.0  ...         NaN         NaN
amjad             NaN         NaN  ...      2000.0         NaN
bhura          2000.0      2000.0  ...      2000.0         NaN
car               NaN         NaN  ...       500.0         NaN
cash           4000.0      4000.0  ...      5500.0         NaN
dinesh            0.0         NaN  ...         NaN         NaN
gulfam         2000.0         NaN  ...         NaN         NaN
hasan             NaN         NaN  ...      2000.0         NaN
imran             0.0      2000.0  ...      2000.0         NaN
jabir          2000.0         NaN  ...         NaN         NaN
julfan         2000.0         NaN  ...         NaN         NaN
khan           2000.0         NaN  ...         NaN         NaN
khurseed       2000.0      2000.0  ...      2000.0         0.0
mujahid        2000.0         NaN  ...         NaN         NaN
mukarram       2000.0         NaN  ...         NaN         NaN
rasid             NaN      2000.0  ...         NaN         NaN
sabir jcb         NaN      3000.0  ...         NaN         NaN
saddam            NaN      2000.0  ...         NaN         NaN
total         22000.0     19000.0  ...     16000.0         NaN
vakil jcb         NaN         0.0  ...         0.0         0.0
zishan         2000.0         0.0  ...         0.0         NaN

[21 rows x 13 columns]

Date       2019-09-16  2019-09-17  ...  2019-09-29  2019-10-01
Name                               ...
akram             NaN      2000.0  ...         NaN         NaN
amjad             NaN         NaN  ...      2000.0         NaN
bhura          2000.0      2000.0  ...      2000.0         NaN
car               NaN         NaN  ...       500.0         NaN
cash           4000.0      4000.0  ...      5500.0         NaN
dinesh            0.0         NaN  ...         NaN         NaN
gulfam         2000.0         NaN  ...         NaN         NaN
hasan             NaN         NaN  ...      2000.0         NaN
imran             0.0      2000.0  ...      2000.0         NaN
jabir          2000.0         NaN  ...         NaN         NaN
julfan         2000.0         NaN  ...         NaN         NaN
khan           2000.0         NaN  ...         NaN         NaN
khurseed       2000.0      2000.0  ...      2000.0         0.0
mujahid        2000.0         NaN  ...         NaN         NaN
mukarram       2000.0         NaN  ...         NaN         NaN
rasid             NaN      2000.0  ...         NaN         NaN
sabir jcb         NaN      3000.0  ...         NaN         NaN
saddam            NaN      2000.0  ...         NaN         NaN
total         22000.0     19000.0  ...     16000.0         NaN
vakil jcb         NaN         0.0  ...         0.0         0.0
zishan         2000.0         0.0  ...         0.0         NaN

[21 rows x 13 columns]

In [254]:
pivot_cash = diesel.pivot_table(index = 'Name', columns = 'Date', values = 'Cash')
pivot_cash

Date       2019-09-16  2019-09-17  ...  2019-09-29  2019-10-01
Name                               ...
akram             NaN       200.0  ...         NaN         NaN
bhura             NaN         NaN  ...       370.0         NaN
dinesh          300.0         NaN  ...         NaN         NaN
gulfam            NaN         NaN  ...         NaN         NaN
imran           400.0       200.0  ...       500.0         NaN
jabir             NaN         NaN  ...         NaN         NaN
julfan          500.0         NaN  ...         NaN         NaN
khurseed        800.0       500.0  ...       500.0       200.0
saddam            NaN         NaN  ...         NaN         NaN
vakil jcb         NaN      1000.0  ...       500.0      5000.0
zishan            NaN       500.0  ...       500.0         NaN

[11 rows x 13 columns]

Date       2019-09-16  2019-09-17  ...  2019-09-29  2019-10-01
Name                               ...
akram             NaN       200.0  ...         NaN         NaN
bhura             NaN         NaN  ...       370.0         NaN
dinesh          300.0         NaN  ...         NaN         NaN
gulfam            NaN         NaN  ...         NaN         NaN
imran           400.0       200.0  ...       500.0         NaN
jabir             NaN         NaN  ...         NaN         NaN
julfan          500.0         NaN  ...         NaN         NaN
khurseed        800.0       500.0  ...       500.0       200.0
saddam            NaN         NaN  ...         NaN         NaN
vakil jcb         NaN      1000.0  ...       500.0      5000.0
zishan            NaN       500.0  ...       500.0         NaN

[11 rows x 13 columns]

In [0]:
pivot_diesel.fillna(value = 0, inplace = True)

In [0]:
pivot_cash.fillna(value = 0, inplace = True)

In [257]:
pivot_diesel

Date       2019-09-16  2019-09-17  ...  2019-09-29  2019-10-01
Name                               ...
akram             0.0      2000.0  ...         0.0         0.0
amjad             0.0         0.0  ...      2000.0         0.0
bhura          2000.0      2000.0  ...      2000.0         0.0
car               0.0         0.0  ...       500.0         0.0
cash           4000.0      4000.0  ...      5500.0         0.0
dinesh            0.0         0.0  ...         0.0         0.0
gulfam         2000.0         0.0  ...         0.0         0.0
hasan             0.0         0.0  ...      2000.0         0.0
imran             0.0      2000.0  ...      2000.0         0.0
jabir          2000.0         0.0  ...         0.0         0.0
julfan         2000.0         0.0  ...         0.0         0.0
khan           2000.0         0.0  ...         0.0         0.0
khurseed       2000.0      2000.0  ...      2000.0         0.0
mujahid        2000.0         0.0  ...         0.0         0.0
mukarram       2000.0         0.0  ...         0.0         0.0
rasid             0.0      2000.0  ...         0.0         0.0
sabir jcb         0.0      3000.0  ...         0.0         0.0
saddam            0.0      2000.0  ...         0.0         0.0
total         22000.0     19000.0  ...     16000.0         0.0
vakil jcb         0.0         0.0  ...         0.0         0.0
zishan         2000.0         0.0  ...         0.0         0.0

[21 rows x 13 columns]

Date       2019-09-16  2019-09-17  ...  2019-09-29  2019-10-01
Name                               ...
akram             0.0      2000.0  ...         0.0         0.0
amjad             0.0         0.0  ...      2000.0         0.0
bhura          2000.0      2000.0  ...      2000.0         0.0
car               0.0         0.0  ...       500.0         0.0
cash           4000.0      4000.0  ...      5500.0         0.0
dinesh            0.0         0.0  ...         0.0         0.0
gulfam         2000.0         0.0  ...         0.0         0.0
hasan             0.0         0.0  ...      2000.0         0.0
imran             0.0      2000.0  ...      2000.0         0.0
jabir          2000.0         0.0  ...         0.0         0.0
julfan         2000.0         0.0  ...         0.0         0.0
khan           2000.0         0.0  ...         0.0         0.0
khurseed       2000.0      2000.0  ...      2000.0         0.0
mujahid        2000.0         0.0  ...         0.0         0.0
mukarram       2000.0         0.0  ...         0.0         0.0
rasid             0.0      2000.0  ...         0.0         0.0
sabir jcb         0.0      3000.0  ...         0.0         0.0
saddam            0.0      2000.0  ...         0.0         0.0
total         22000.0     19000.0  ...     16000.0         0.0
vakil jcb         0.0         0.0  ...         0.0         0.0
zishan         2000.0         0.0  ...         0.0         0.0

[21 rows x 13 columns]

In [258]:
pivot_cash

Date       2019-09-16  2019-09-17  ...  2019-09-29  2019-10-01
Name                               ...
akram             0.0       200.0  ...         0.0         0.0
bhura             0.0         0.0  ...       370.0         0.0
dinesh          300.0         0.0  ...         0.0         0.0
gulfam            0.0         0.0  ...         0.0         0.0
imran           400.0       200.0  ...       500.0         0.0
jabir             0.0         0.0  ...         0.0         0.0
julfan          500.0         0.0  ...         0.0         0.0
khurseed        800.0       500.0  ...       500.0       200.0
saddam            0.0         0.0  ...         0.0         0.0
vakil jcb         0.0      1000.0  ...       500.0      5000.0
zishan            0.0       500.0  ...       500.0         0.0

[11 rows x 13 columns]

Date       2019-09-16  2019-09-17  ...  2019-09-29  2019-10-01
Name                               ...
akram             0.0       200.0  ...         0.0         0.0
bhura             0.0         0.0  ...       370.0         0.0
dinesh          300.0         0.0  ...         0.0         0.0
gulfam            0.0         0.0  ...         0.0         0.0
imran           400.0       200.0  ...       500.0         0.0
jabir             0.0         0.0  ...         0.0         0.0
julfan          500.0         0.0  ...         0.0         0.0
khurseed        800.0       500.0  ...       500.0       200.0
saddam            0.0         0.0  ...         0.0         0.0
vakil jcb         0.0      1000.0  ...       500.0      5000.0
zishan            0.0       500.0  ...       500.0         0.0

[11 rows x 13 columns]

In [259]:
pivot_diesel['Total Diesel'] = pd.Series([0 for i in range(len(pivot_diesel))])
pivot_diesel.head(1)

Date   2019-09-16 00:00:00  ...  Total Diesel
Name                        ...
akram                  0.0  ...           NaN

[1 rows x 14 columns]

Date   2019-09-16 00:00:00  ...  Total Diesel
Name                        ...
akram                  0.0  ...           NaN

[1 rows x 14 columns]

In [260]:
pivot_cash['Total Cash'] = pd.Series([0 for i in range(len(pivot_cash))])
pivot_cash.head(1)

Date   2019-09-16 00:00:00  ...  Total Cash
Name                        ...
akram                  0.0  ...         NaN

[1 rows x 14 columns]

Date   2019-09-16 00:00:00  ...  Total Cash
Name                        ...
akram                  0.0  ...         NaN

[1 rows x 14 columns]

In [0]:
for i in range(len(pivot_diesel)):
  pivot_diesel['Total Diesel'][i] = sum(pivot_diesel.iloc[i, 0:-1])

In [262]:
pivot_diesel

Date       2019-09-16 00:00:00  ...  Total Diesel
Name                            ...
akram                      0.0  ...        4000.0
amjad                      0.0  ...       10000.0
bhura                   2000.0  ...       14000.0
car                        0.0  ...        1000.0
cash                    4000.0  ...       43900.0
dinesh                     0.0  ...        6000.0
gulfam                  2000.0  ...       13000.0
hasan                      0.0  ...        8000.0
imran                      0.0  ...       18000.0
jabir                   2000.0  ...       13000.0
julfan                  2000.0  ...       11900.0
khan                    2000.0  ...        2000.0
khurseed                2000.0  ...       17200.0
mujahid                 2000.0  ...        2000.0
mukarram                2000.0  ...        5000.0
rasid                      0.0  ...       14000.0
sabir jcb                  0.0  ...        3500.0
saddam                     0.0  ...       12000.0
total                  22000.0  ...      220300.0
vakil jcb                  0.0  ...       19800.0
zishan                  2000.0  ...        2000.0

[21 rows x 14 columns]

Date       2019-09-16 00:00:00  ...  Total Diesel
Name                            ...
akram                      0.0  ...        4000.0
amjad                      0.0  ...       10000.0
bhura                   2000.0  ...       14000.0
car                        0.0  ...        1000.0
cash                    4000.0  ...       43900.0
dinesh                     0.0  ...        6000.0
gulfam                  2000.0  ...       13000.0
hasan                      0.0  ...        8000.0
imran                      0.0  ...       18000.0
jabir                   2000.0  ...       13000.0
julfan                  2000.0  ...       11900.0
khan                    2000.0  ...        2000.0
khurseed                2000.0  ...       17200.0
mujahid                 2000.0  ...        2000.0
mukarram                2000.0  ...        5000.0
rasid                      0.0  ...       14000.0
sabir jcb                  0.0  ...        3500.0
saddam                     0.0  ...       12000.0
total                  22000.0  ...      220300.0
vakil jcb                  0.0  ...       19800.0
zishan                  2000.0  ...        2000.0

[21 rows x 14 columns]

In [0]:
for i in range(len(pivot_cash)):
  pivot_cash['Total Cash'][i] = sum(pivot_cash.iloc[i, 0:-1])

In [264]:
pivot_cash

Date       2019-09-16 00:00:00  ...  Total Cash
Name                            ...
akram                      0.0  ...      1800.0
bhura                      0.0  ...      1070.0
dinesh                   300.0  ...      1300.0
gulfam                     0.0  ...      3100.0
imran                    400.0  ...      2900.0
jabir                      0.0  ...      1000.0
julfan                   500.0  ...      9900.0
khurseed                 800.0  ...     15700.0
saddam                     0.0  ...       500.0
vakil jcb                  0.0  ...     13400.0
zishan                     0.0  ...      1000.0

[11 rows x 14 columns]

Date       2019-09-16 00:00:00  ...  Total Cash
Name                            ...
akram                      0.0  ...      1800.0
bhura                      0.0  ...      1070.0
dinesh                   300.0  ...      1300.0
gulfam                     0.0  ...      3100.0
imran                    400.0  ...      2900.0
jabir                      0.0  ...      1000.0
julfan                   500.0  ...      9900.0
khurseed                 800.0  ...     15700.0
saddam                     0.0  ...       500.0
vakil jcb                  0.0  ...     13400.0
zishan                     0.0  ...      1000.0

[11 rows x 14 columns]

In [265]:
diesel_by_name = pivot_diesel[['Total Diesel']]
diesel_by_name

Date       Total Diesel
Name
akram            4000.0
amjad           10000.0
bhura           14000.0
car              1000.0
cash            43900.0
dinesh           6000.0
gulfam          13000.0
hasan            8000.0
imran           18000.0
jabir           13000.0
julfan          11900.0
khan             2000.0
khurseed        17200.0
mujahid          2000.0
mukarram         5000.0
rasid           14000.0
sabir jcb        3500.0
saddam          12000.0
total          220300.0
vakil jcb       19800.0
zishan           2000.0

Date       Total Diesel
Name
akram            4000.0
amjad           10000.0
bhura           14000.0
car              1000.0
cash            43900.0
dinesh           6000.0
gulfam          13000.0
hasan            8000.0
imran           18000.0
jabir           13000.0
julfan          11900.0
khan             2000.0
khurseed        17200.0
mujahid          2000.0
mukarram         5000.0
rasid           14000.0
sabir jcb        3500.0
saddam          12000.0
total          220300.0
vakil jcb       19800.0
zishan           2000.0

In [266]:
name1 = set(diesel_by_name.index)
name1

{'akram',
 'amjad',
 'bhura',
 'car',
 'cash',
 'dinesh',
 'gulfam',
 'hasan',
 'imran',
 'jabir',
 'julfan',
 'khan',
 'khurseed',
 'mujahid',
 'mukarram',
 'rasid',
 'sabir jcb',
 'saddam',
 'total',
 'vakil jcb',
 'zishan'}

{'akram',
 'amjad',
 'bhura',
 'car',
 'cash',
 'dinesh',
 'gulfam',
 'hasan',
 'imran',
 'jabir',
 'julfan',
 'khan',
 'khurseed',
 'mujahid',
 'mukarram',
 'rasid',
 'sabir jcb',
 'saddam',
 'total',
 'vakil jcb',
 'zishan'}

In [267]:
name2 = set(df.Name.unique())
name2

{'akram',
 'amjad',
 'aslam',
 'bhura',
 'dinesh',
 'gulfam',
 'hasan',
 'imran',
 'jabir',
 'julfan',
 'khan',
 'khurseed',
 'mujahid',
 'mukarram',
 'rasid',
 'saddam',
 'zishan'}

{'akram',
 'amjad',
 'aslam',
 'bhura',
 'dinesh',
 'gulfam',
 'hasan',
 'imran',
 'jabir',
 'julfan',
 'khan',
 'khurseed',
 'mujahid',
 'mukarram',
 'rasid',
 'saddam',
 'zishan'}

In [268]:
name1 - name2

{'car', 'cash', 'sabir jcb', 'total', 'vakil jcb'}

{'car', 'cash', 'sabir jcb', 'total', 'vakil jcb'}

In [269]:
cash_by_name = pivot_cash[['Total Cash']]
cash_by_name

Date       Total Cash
Name
akram          1800.0
bhura          1070.0
dinesh         1300.0
gulfam         3100.0
imran          2900.0
jabir          1000.0
julfan         9900.0
khurseed      15700.0
saddam          500.0
vakil jcb     13400.0
zishan         1000.0

Date       Total Cash
Name
akram          1800.0
bhura          1070.0
dinesh         1300.0
gulfam         3100.0
imran          2900.0
jabir          1000.0
julfan         9900.0
khurseed      15700.0
saddam          500.0
vakil jcb     13400.0
zishan         1000.0

# Total Quantity per name

In [0]:
name_groups = df.groupby('Name')
name_total_quantity = pd.DataFrame(columns = ['Name', 'Total Quantity'])
for i, j in name_groups:
  name_total_quantity = name_total_quantity.append({'Name':i, 'Total Quantity': sum(j.Quantity)}, ignore_index = True)
  
name_total_quantity.sort_values(by = ['Total Quantity'], ascending = False, inplace = True)

In [271]:
name_total_quantity

        Name Total Quantity
7      imran          11513
14     rasid          10962
11  khurseed           9775
5     gulfam           8739
15    saddam           8370
3      bhura           8337
8      jabir           7072
9     julfan           6630
4     dinesh           6045
1      amjad           5925
6      hasan           4800
13  mukarram           4000
0      akram           2160
16    zishan           1936
10      khan           1700
12   mujahid           1140
2      aslam            484

        Name Total Quantity
7      imran          11513
14     rasid          10962
11  khurseed           9775
5     gulfam           8739
15    saddam           8370
3      bhura           8337
8      jabir           7072
9     julfan           6630
4     dinesh           6045
1      amjad           5925
6      hasan           4800
13  mukarram           4000
0      akram           2160
16    zishan           1936
10      khan           1700
12   mujahid           1140
2      aslam            484

In [0]:
diesel_by_name.reset_index(inplace = True)

In [273]:
diesel_by_name.head(1)

Date   Name  Total Diesel
0     akram        4000.0

Date   Name  Total Diesel
0     akram        4000.0

In [0]:
cash_by_name.reset_index(inplace = True)

In [275]:
cash_by_name.head(2)

Date   Name  Total Cash
0     akram      1800.0
1     bhura      1070.0

Date   Name  Total Cash
0     akram      1800.0
1     bhura      1070.0

In [276]:
name_total_quantity.shape

(17, 2)

(17, 2)

In [277]:
diesel_by_name.shape

(21, 2)

(21, 2)

In [278]:
name1 - name2

{'car', 'cash', 'sabir jcb', 'total', 'vakil jcb'}

{'car', 'cash', 'sabir jcb', 'total', 'vakil jcb'}

In [279]:
names = df.Name.unique()
names

array(['khurseed', 'gulfam', 'bhura', 'rasid', 'akram', 'imran',
       'mukarram', 'julfan', 'jabir', 'dinesh', 'zishan', 'khan',
       'mujahid', 'saddam', 'aslam', 'amjad', 'hasan'], dtype=object)

array(['khurseed', 'gulfam', 'bhura', 'rasid', 'akram', 'imran',
       'mukarram', 'julfan', 'jabir', 'dinesh', 'zishan', 'khan',
       'mujahid', 'saddam', 'aslam', 'amjad', 'hasan'], dtype=object)

In [280]:
diesel_by_name.head(1)

Date   Name  Total Diesel
0     akram        4000.0

Date   Name  Total Diesel
0     akram        4000.0

In [0]:
final = pd.DataFrame(columns = ['Name','Rounds' , 'Total Quantity', 'Amount', 'Diesel', 'Amount - Diesel', 'Cash', 'Balance'])
for i in names:
    total_quantity = name_total_quantity[name_total_quantity.Name == i]['Total Quantity'].values[0]
    if i in diesel_by_name.Name.values:
      total_diesel = diesel_by_name[diesel_by_name.Name == i]['Total Diesel'].values[0]
    else:
      total_diesel = 0
    try:
        total_cash = cash_by_name[cash_by_name.Name == i]['Total Cash'].values[0]
    except:
        total_cash = 0
    #print(i, total_cash)
    final = final.append({'Name': i,'Total Quantity':total_quantity,
                            'Rounds':rounds_per_name.get(i),
                            'Amount':total_quantity*3,
                            'Diesel':total_diesel,
                            'Cash':total_cash,
                            'Amount - Diesel':total_quantity*3 - total_diesel,
                            'Balance':total_quantity*3 - total_diesel - total_cash},
                           ignore_index = True)

In [0]:
final.sort_values(by = 'Total Quantity', ascending = False, inplace = True)

In [292]:
final

        Name Rounds Total Quantity  ... Amount - Diesel     Cash  Balance
5      imran     29          11513  ...         16539.0   2900.0  13639.0
3      rasid     27          10962  ...         18886.0      0.0  18886.0
0   khurseed     25           9775  ...         12125.0  15700.0  -3575.0
1     gulfam     19           8739  ...         13217.0   3100.0  10117.0
13    saddam     18           8370  ...         13110.0    500.0  12610.0
2      bhura     21           8337  ...         11011.0   1070.0   9941.0
8      jabir     17           7072  ...          8216.0   1000.0   7216.0
7     julfan     17           6630  ...          7990.0   9900.0  -1910.0
9     dinesh     13           6045  ...         12135.0   1300.0  10835.0
15     amjad     15           5925  ...          7775.0      0.0   7775.0
16     hasan     12           4800  ...          6400.0      0.0   6400.0
6   mukarram     10           4000  ...          7000.0      0.0   7000.0
4      akram      6           2160  ...          2480.0   1800.0    680.0
10    zishan      4           1936  ...          3808.0   1000.0   2808.0
11      khan      4           1700  ...          3100.0      0.0   3100.0
12   mujahid      3           1140  ...          1420.0      0.0   1420.0
14     aslam      1            484  ...          1452.0      0.0   1452.0

[17 rows x 8 columns]

In [283]:
final.sum()

Name               imranrasidkhurseedgulfamsaddambhurajabirjulfan...
Rounds                                                           241
Total Quantity                                                 99588
Amount                                                        298764
Diesel                                                        152100
Amount - Diesel                                               146664
Cash                                                           38270
Balance                                                       108394
dtype: object

Name               imranrasidkhurseedgulfamsaddambhurajabirjulfan...
Rounds                                                           241
Total Quantity                                                 99588
Amount                                                        298764
Diesel                                                        152100
Amount - Diesel                                               146664
Cash                                                           38270
Balance                                                       108394
dtype: object

In [293]:
final.append({'Name': 'Total', 'Rounds': sum(final.Rounds), 'Total Quantity':sum(final['Total Quantity']),	'Amount':sum(final.Amount),
              'Diesel':sum(final.Diesel), 'Amount - Diesel':sum(final['Amount - Diesel']), 'Cash':sum(final['Cash']), 
              'Balance':sum(final['Balance'])},
              ignore_index = True)

        Name Rounds Total Quantity  ... Amount - Diesel     Cash   Balance
0      imran     29          11513  ...         16539.0   2900.0   13639.0
1      rasid     27          10962  ...         18886.0      0.0   18886.0
2   khurseed     25           9775  ...         12125.0  15700.0   -3575.0
3     gulfam     19           8739  ...         13217.0   3100.0   10117.0
4     saddam     18           8370  ...         13110.0    500.0   12610.0
5      bhura     21           8337  ...         11011.0   1070.0    9941.0
6      jabir     17           7072  ...          8216.0   1000.0    7216.0
7     julfan     17           6630  ...          7990.0   9900.0   -1910.0
8     dinesh     13           6045  ...         12135.0   1300.0   10835.0
9      amjad     15           5925  ...          7775.0      0.0    7775.0
10     hasan     12           4800  ...          6400.0      0.0    6400.0
11  mukarram     10           4000  ...          7000.0      0.0    7000.0
12     akram      6           2160  ...          2480.0   1800.0     680.0
13    zishan      4           1936  ...          3808.0   1000.0    2808.0
14      khan      4           1700  ...          3100.0      0.0    3100.0
15   mujahid      3           1140  ...          1420.0      0.0    1420.0
16     aslam      1            484  ...          1452.0      0.0    1452.0
17     Total    241          99588  ...        146664.0  38270.0  108394.0

[18 rows x 8 columns]

In [294]:
vakil_diesel = diesel_by_name[diesel_by_name.Name == 'vakil jcb']['Total Diesel']
vakil_diesel

19    19800.0
Name: Total Diesel, dtype: float64

In [295]:
cash_diesel = diesel_by_name[diesel_by_name.Name == 'cash']['Total Diesel']
cash_diesel

4    43900.0
Name: Total Diesel, dtype: float64

In [296]:
diesel_to_people = final.sum().get('Diesel')
diesel_to_people

152100.0

In [297]:
car = diesel_by_name[diesel_by_name.Name == 'car']['Total Diesel'].values[0]
car

1000.0

In [289]:
final.sum(axis = 0, skipna = True)

Name               imranrasidkhurseedgulfamsaddambhurajabirjulfan...
Rounds                                                           241
Total Quantity                                                 99588
Amount                                                        298764
Diesel                                                        152100
Amount - Diesel                                               146664
Cash                                                           38270
Balance                                                       108394
dtype: object

Name               imranrasidkhurseedgulfamsaddambhurajabirjulfan...
Rounds                                                           241
Total Quantity                                                 99588
Amount                                                        298764
Diesel                                                        152100
Amount - Diesel                                               146664
Cash                                                           38270
Balance                                                       108394
dtype: object

In [290]:
total_q = sum(final['Total Quantity'])
total_q

99588

99588

# Total payable